quest_system_2080256500_name=^?^Violetta's Soul
quest_system_2080256500_stage_0=^?^Go to the Land of Death. To do this you should read a Book of Death.
quest_system_2080256500_stage_1=^?^Find the Castle Necrocom, capital of the undead, and refuge of General Karador.
quest_system_2080256500_stage_2=^?^Destroy the Crystal of Darkness, inside which are trapped the souls of Karador's victims.
quest_system_2080256500_stage_3=^?^Speak to the Tree of Life and ask it for help in fighting the creatures of the undead.
quest_system_2080256500_stage_4=^?^Violetta is free, and you can now talk to her about King Mark's daughter.
quest_system_2080256500_stage_5=^?^Tell King Mark about the agreement with Violetta, and about traveling through the Dragons' Labyrinth to Murock.
quest_system_2080256500_task=^?^Alas, but at present you can get no more information from Queen Violetta. Her mind wanders lost, her will dominated by General Karador, who has stolen the queen's soul.<br>[reward]
